# Welcome to pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Ali','Ebad','Hamza','Usama'],
    "marks":[92,45,67,46],
    "city":['Karachi','Hyderabad',"Islamabad","Lahore"]
}

In [3]:
dict1

{'name': ['Ali', 'Ebad', 'Hamza', 'Usama'],
 'marks': [92, 45, 67, 46],
 'city': ['Karachi', 'Hyderabad', 'Islamabad', 'Lahore']}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  marks       city
0    Ali     92    Karachi
1   Ebad     45  Hyderabad
2  Hamza     67  Islamabad
3  Usama     46     Lahore

In [6]:
df.to_csv("students.csv")

In [7]:
df.to_csv("students_without_index.csv", index=False)

In [8]:
df.head(2)

   name  marks       city
0   Ali     92    Karachi
1  Ebad     45  Hyderabad

In [9]:
df.tail(1)

    name  marks    city
3  Usama     46  Lahore

In [10]:
df.describe()

           marks
count   4.000000
mean   62.500000
std    22.128413
min    45.000000
25%    45.750000
50%    56.500000
75%    73.250000
max    92.000000

In [11]:
ad = pd.read_csv("Advertising.csv")

In [12]:
ad

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [13]:
ad.head(5)

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [14]:
ad['Sales']

0      22.1
1      10.4
2       9.3
3      18.5
4      12.9
       ...
195     7.6
196     9.7
197    12.8
198    25.5
199    13.4
Name: Sales, Length: 200, dtype: float64

In [15]:
ad['Sales'][0]

22.1

In [19]:
ad['Sales'][0] = 23

C:\Users\khalid\AppData\Local\Temp\ipykernel_8360\2677665373.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ad['Sales'][0] = 23

In [17]:
ad['Sales'][0]

23.0

In [20]:
ser = pd.Series(np.random.rand(34))

In [ ]:
ser

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
newdf =pd.DataFrame(np.random.rand(150,5), index = np.arange(150))

In [24]:
newdf.head()

          0         1         2         3         4
0  0.041339  0.016355  0.274835  0.901813  0.186271
1  0.007504  0.855768  0.340020  0.658188  0.397877
2  0.156719  0.680846  0.918347  0.262575  0.063892
3  0.613526  0.460485  0.852211  0.369895  0.136931
4  0.706010  0.116582  0.357868  0.943222  0.919549

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [28]:
newdf.describe()

                0           1           2           3           4
count  150.000000  150.000000  150.000000  150.000000  150.000000
mean     0.492726    0.492399    0.493203    0.478564    0.526751
std      0.286433    0.296741    0.282377    0.283412    0.287697
min      0.005394    0.002303    0.003499    0.002311    0.001128
25%      0.242530    0.239742    0.248173    0.234163    0.253458
50%      0.499239    0.490366    0.495648    0.480168    0.570345
75%      0.744475    0.741388    0.737659    0.719697    0.770181
max      0.998866    0.994609    0.979378    0.993482    0.981498

In [33]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
      dtype='int32', length=150)

In [35]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
newdf.sort_index(axis = 1 ,ascending=False)

            4         3         2         1         0
0    0.186271  0.901813  0.274835  0.016355  0.041339
1    0.397877  0.658188  0.340020  0.855768  0.007504
2    0.063892  0.262575  0.918347  0.680846  0.156719
3    0.136931  0.369895  0.852211  0.460485  0.613526
4    0.919549  0.943222  0.357868  0.116582  0.706010
..        ...       ...       ...       ...       ...
145  0.737796  0.456659  0.356725  0.811742  0.765772
146  0.193845  0.421408  0.133750  0.742156  0.360054
147  0.001128  0.883976  0.005352  0.042205  0.317406
148  0.279948  0.069490  0.258518  0.137810  0.763166
149  0.043048  0.050847  0.050782  0.334262  0.495289

[150 rows x 5 columns]

In [39]:
type(newdf[0])

pandas.core.series.Series

In [41]:
newdf.head()

          0         1         2         3         4
0  0.041339  0.016355  0.274835  0.901813  0.186271
1  0.007504  0.855768  0.340020  0.658188  0.397877
2  0.156719  0.680846  0.918347  0.262575  0.063892
3  0.613526  0.460485  0.852211  0.369895  0.136931
4  0.706010  0.116582  0.357868  0.943222  0.919549

In [42]:
newdf2 = newdf.copy()

In [43]:
newdf2.head()

          0         1         2         3         4
0  0.041339  0.016355  0.274835  0.901813  0.186271
1  0.007504  0.855768  0.340020  0.658188  0.397877
2  0.156719  0.680846  0.918347  0.262575  0.063892
3  0.613526  0.460485  0.852211  0.369895  0.136931
4  0.706010  0.116582  0.357868  0.943222  0.919549

In [51]:
newdf2[0][0] = 2

C:\Users\khalid\AppData\Local\Temp\ipykernel_8360\2252306501.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 2

In [53]:
newdf.loc[0.0] = 654

In [54]:
newdf.head(2)

            0           1          2           3           4
0  654.000000  654.000000  654.00000  654.000000  654.000000
1    0.007504    0.855768    0.34002    0.658188    0.397877

In [55]:
newdf.columns = list("ABCDE")

In [56]:
newdf

              A           B           C           D           E
0    654.000000  654.000000  654.000000  654.000000  654.000000
1      0.007504    0.855768    0.340020    0.658188    0.397877
2      0.156719    0.680846    0.918347    0.262575    0.063892
3      0.613526    0.460485    0.852211    0.369895    0.136931
4      0.706010    0.116582    0.357868    0.943222    0.919549
..          ...         ...         ...         ...         ...
145    0.765772    0.811742    0.356725    0.456659    0.737796
146    0.360054    0.742156    0.133750    0.421408    0.193845
147    0.317406    0.042205    0.005352    0.883976    0.001128
148    0.763166    0.137810    0.258518    0.069490    0.279948
149    0.495289    0.334262    0.050782    0.050847    0.043048

[150 rows x 5 columns]

In [57]:
newdf.loc[0,0] = 545

In [58]:
newdf.head()

            A           B           C           D           E      0
0  654.000000  654.000000  654.000000  654.000000  654.000000  545.0
1    0.007504    0.855768    0.340020    0.658188    0.397877    NaN
2    0.156719    0.680846    0.918347    0.262575    0.063892    NaN
3    0.613526    0.460485    0.852211    0.369895    0.136931    NaN
4    0.706010    0.116582    0.357868    0.943222    0.919549    NaN

In [59]:
newdf.loc[0,'A'] = 897

In [60]:
newdf.head()

            A           B           C           D           E      0
0  897.000000  654.000000  654.000000  654.000000  654.000000  545.0
1    0.007504    0.855768    0.340020    0.658188    0.397877    NaN
2    0.156719    0.680846    0.918347    0.262575    0.063892    NaN
3    0.613526    0.460485    0.852211    0.369895    0.136931    NaN
4    0.706010    0.116582    0.357868    0.943222    0.919549    NaN

In [62]:
newdf.drop(0, axis=1)

              A           B           C           D           E
0    897.000000  654.000000  654.000000  654.000000  654.000000
1      0.007504    0.855768    0.340020    0.658188    0.397877
2      0.156719    0.680846    0.918347    0.262575    0.063892
3      0.613526    0.460485    0.852211    0.369895    0.136931
4      0.706010    0.116582    0.357868    0.943222    0.919549
..          ...         ...         ...         ...         ...
145    0.765772    0.811742    0.356725    0.456659    0.737796
146    0.360054    0.742156    0.133750    0.421408    0.193845
147    0.317406    0.042205    0.005352    0.883976    0.001128
148    0.763166    0.137810    0.258518    0.069490    0.279948
149    0.495289    0.334262    0.050782    0.050847    0.043048

[150 rows x 5 columns]

In [63]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.340020  0.658188
2  0.918347  0.262575

In [73]:
newdf.loc[1:5,'A':'D']

          A         B         C         D
1  0.007504  0.855768  0.340020  0.658188
2  0.156719  0.680846  0.918347  0.262575
3  0.613526  0.460485  0.852211  0.369895
4  0.706010  0.116582  0.357868  0.943222
5  0.139509  0.594349  0.867922  0.126349